#+Title: Why teaching functional programming to undergraduates at CUNY is important
#+Author: Evan Misshula
#+Email: emisshula@jjay.cuny.edu
#+Date: 2018-03-28

#+OPTIONS: H:2 toc:nil num:t
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n) export(e)
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+STARTUP: beamer
#+EXPORT_SELECT_TAGS: export(e)
#+EXPORT_EXCLUDE_TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presetation]
#+BEAMER_THEME: Madrid
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

*** Infix fmap in the repl
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle no
(++) <$> Just "John " <*> Just "Travolta"
(++) "John " "Travolta"
1==1 
#+end_src

#+RESULTS:
: Just "John Travolta"
: John Travolta

*** Applicative Functors of lists in the repl
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle no
[(*0),(+100),(^2)] <*> [1..4]
[(+),(*)] <*>[1,2]<*>[3,4]
(++) <$> ["ha","heh","hmm"] <*> ["?","!","."]
1==1
#+end_src

#+RESULTS:
: [0,0,0,0,101,102,103,104,1,4,9,16]
: [4,5,5,6,3,4,6,8]
: ["ha?","ha!","ha.","heh?","heh!","heh.","hmm?","hmm!","hmm."]

